/*
	核心思想统计排序数组元素的各个数量
	然后根据关键字排序
	
	辅助记录思想
	统计思想
	
*/

void discount(int a[],int n)
{
	int i,j;
	int cnt[M]
	
	for(i=0;i<M;i++) cnt[i]=0;
	
	for(i=0;i<n;i++) cnt[a[i]+1]++//初始cnt[a[i]]存放<a[i]的整数数量, cnt[a[i]+1]存放a[i]数量cnt[0]:x<0;cnt[1]:0<=x<1:cnt[1]:1<=x<2;
	
	for(j=1;j<M;j++) cnt[j]+=cnt[j-1];//此时为x<0;x<1;x<2...的分布
	
	for(i=0;i<n;i++) b[cnt[a[i]]++]=a[i]//分发移动指针
	
	for()
	//将b[i]赋值回去给a[i];
	/*
	a[n]	0 3 3 0 1 1 0 3 0 2 0 1 1 2 0
	
		0 1 2 3
		
		0 6 10 12
		
		for(i=0;i<n;i++) b[cnt[a[i]]++]=a[i]
		
		遇到0 b[cnt[0]++]=0; => b[0]=1,cnt[0]++
		
		0 1 2 3
		
		1 6 10 12
		
		0 1 2 3
		
		1 6 10 13 :b[12]=3
		
		...
		
		0 1 2 3
		
		5 9 11 14
		
		cnt[i]先是统计数量后当作移动指针
		
		
	*/
	
}




/*
	若M很大且数组元素零散则空间浪费严重
	改进思想：用b[]数组保存元素用cnt[]保存数量
	然后对b排序后分发
*/



